const source = `

Листопад
1. Луки (1-2) у контексті
2. (1:1-4)
3. (1:5-25)
4. (1:26-38)
5. (1:39-45)
6. (1:46-56)
7. Субота – день спочинку
8. (1:57-66)
9. (1:67-80)
10. (2:1-7)
11. (2:8-20)
12. (2:21-40)
13. (2:41-52)
14. Субота – день спочинку
15. Луки (3:1-4:13) у контексті
16. (3:1-20)
17. (3:21-22)
18. (3:23-38)
19. (4:1-13)
20. Луки (4:14-6:16) у контексті
21. Субота – день спочинку
22. (4:14-30)
23. (4:31-37)
24. (4:38-44)
25. (5:1-11)
26. (5:12-16)
27. (5:17-26)
28. Субота – день спочинку
29. (5:27-32)
30. (5:33-39)

Грудень
1. (6:1-11)
2. (6:12-16)
3. Луки (6:17-49) у контексті
4. (6:17-26)
5. Субота – день спочинку
6. (6:27-36)
7. (6:37-42)
8. (6:43-45)
9. (6:46-49)
10. Луки (7:1-9:50) у контексті
11. (7:1-10)
12. Субота – день спочинку
13. (7:11-17)
14. (7:18-35)
15. (7:36-50)
16. (8:1-15)
17. (8:16-18)
18. (8:19-21)
19. Субота – день спочинку
20. (8:22-25)
21. (8:26-39)
22. (8:40-56)
23. (9:1-6)
24. (9:7-9)
25. (9:10-17)
26. Субота – день спочинку
27. (9:18-21)
28. (9:22-27)
29. (9:28-36)
30. (9:37-45)
31. (9:46-50)

Січень 2021
1. Луки (9:51-11:54) у контексті
2. Субота – день спочинку
3. (9:51-56)
4. (9:57-62)
5. (10:1-24)
6. (10:25-37)
7. (10:38-42)
8. (11:1-13)
9. Субота – день спочинку
10. (11:14-28)
11. (11:29-32)
12. (11:33-36)
13. (11:37-54)
14. Луки (12:1-13:35) у контексті
15. (12:1-12)
16. Субота – день спочинку
17. (12:13-21)
18. (12:22-34)
19. (12:35-48)
20. (12:49-53)
21. (12:54-59)
22. (13:1-9)
23. Субота – день спочинку
24. (13:10-17)
25. (13:18-21)
26. (13:22-30)
27. (13:31-35)
28. Луки (14:1-18:30) у контексті
29. (14:1-14)
30. Субота – день спочинку
31. (14:15-24)

Лютий
1. (14:25-35)
2. (15:1-7)
3. (15:8-10)
4. (15:11-32)
5. (16:1-18)
6. Субота – день спочинку
7. (16:19-31)
8. (17:1-10)
9. (17:11-19)
10. (17:20-37)
11. (18:1-8)
12. (18:9-14)
13. Субота – день спочинку
14. (18:15-17)
15. (18:18-30)
16. Луки (18:31-19:44) у контексті
17. (18:31-34)
18. (18:35-43)
19. (19:1-10)
20. Субота – день спочинку
21. (19:11-27)
22. (19:28-44)
23. Луки (19:45-21:38) у контексті
24. (19:45-48)
25. (20:1-8)
26. (20:9-19)
27. Субота – день спочинку
28. (20:20-26)

Березень
1. (20:27-40)
2. (20:41-47)
3. (21:1-4)
4. (21:5-19)
5. (21:20-24)
6. Субота – день спочинку
7. (21:25-28)
8. (21:29-33)
9. (21:34-38)
10. Луки (22:1-23:56) у контексті
11. (22:1-6)
12. (22:7-38)
13. Субота – день спочинку
14. (22:39-46)
15. (22:47-53)
16. (22:54-62)
17. (22:63-65)
18. (22:66-71)
19. (23:1-25)
20. Субота – день спочинку
21. (23:26-43)
22. (23:44-49)
23. (23:50-56)
24. Луки (24:1-53) у контексті
25. (24:1-12)
26. (24:13-35)
27. Субота – день спочинку
28. (24:36-49)
29. (24:50-53)

`;

const months = {
  'Листопад': 'nov 2020 UTC',
  'Грудень': 'dec 2020 UTC',
  'Січень': 'jan 2021 UTC',
  'Лютий': 'feb 2021 UTC',
  'Березень': 'mar 2021 UTC',
};

const data = source.split('\n').filter(i => i).reduce((acc, line) => {
  // identify month
  for ([key, m] of Object.entries(months)) {
    if (line.includes(key)) {
      currentMonth = m;
      return acc;
    }
  }

  // identify day
  const [match1, day, data] = line.match(/(\d+)\. (.*)/) || [];

  if (!currentMonth || isNaN(parseInt(day, 10))) {
    throw new Error(`Unexpected line ('${line}')`);
  }

  // identify verse
  const [match2, verse] = data.match(/.*\((.+)\).*/) || [];

  const href = `https://www.biblegateway.com/passage/?search=Luke%20${verse}&version=UKR,ESV`;
  const text = data.replace(verse, `<a href="${href}">${verse}</a>`);
  const date = new Date(`${day} ${currentMonth}`);

  return [...acc, [date, text]];
}, []);

const days = ['Неділя', 'Понеділок', 'Вівторок', 'Середа', 'Четвер', 'П’ятниця', 'Субота'];

const getISODate = date => date.toISOString().match(/(\d{4})-(\d{2})-(\d{2})/);

const list = data.map(([date, text]) => {
  const [isoDate, year, month, day] = getISODate(date);
  const dayIdx = date.getDay();
  const classNames = [];
  if (dayIdx === 0) classNames.push('sunday');
  return `<li data-iso-date="${isoDate}" class="${classNames.join(' ')}">
    <span>${day}.${month} ${days[dayIdx]}</span> ${text}
  </li>`;
}).join("\n");

const html = `<!DOCTYPE html>
<html lang="uk">
<meta charset="utf-8"/>
<meta name="viewport" content="width=device-width, initial-scale=1">

<style>
ul {
  list-style: none;
  padding: 0;
  max-width: 400px;
}
li span {
  display: inline-block;
  width: 120px;
}
li {
  border: 2px solid transparent;
  padding: 5px 10px;
  margin-bottom: -5px;
}
li.sunday {
  margin-bottom: 10px;
}
li.sunday span {
  color: red;
}
li.today {
  border-color: red;
}
</style>

<ul>
${list}
</ul>

<script>
  const getISODate = date => date.toISOString().match(/(\\d{4})-(\\d{2})-(\\d{2})/);
  const [now] = getISODate(new Date);
  const selector = \`[data-iso-date="\${now}"]\`;
  const el = document.querySelector(selector);
  if (el) el.classList.add('today');
</script>
`;

console.log(html);
